#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_vpc.lou: Refreshing state... [id=vpc-09e75138a8dbaa8ed]
aws_subnet.subnet-db-private["sub-a"]: Refreshing state... [id=subnet-00fd9850cbc868ab0]
aws_subnet.subnet-db-private["sub-b"]: Refreshing state... [id=subnet-041f639fb7e1544db]
aws_subnet.subnet-web-private["sub-c"]: Refreshing state... [id=subnet-0aba182135da74256]
aws_subnet.subnet-db-private["sub-c"]: Refreshing state... [id=subnet-0cd1b9271cfb3b34a]
aws_subnet.subnet-web-private["sub-b"]: Refreshing state... [id=subnet-018a7c7c8419f46dd]
aws_internet_gateway.lou-igw: Refreshing state... [id=igw-079c0aff229d97d37]
aws_subnet.subnet-public["sub-c"]: Refreshing state... [id=subnet-063b32caef2c4e12c]
aws_subnet.subnet-web-private["sub-a"]: Refreshing state... [id=subnet-0681e2b4727a01e05]
aws_subnet.subnet-public["sub-a"]: Refreshing state... [id=subnet-0ce320bc3e0692456]
aws_subnet.subnet-public["sub-b"]: Refreshing state... [id=subnet-098bcc4c067b012d6]
aws_route_table.private-rt: Refreshing state... [id=rtb-040e3e9a1ecb23589]
aws_route_table.public-rt: Refreshing state... [id=rtb-0089c11a418e27772]
aws_route_table_association.web-private["sub-c"]: Refreshing state... [id=rtbassoc-0d15bc57575323268]
aws_route_table_association.web-private["sub-a"]: Refreshing state... [id=rtbassoc-0fb4ed47fc188f17c]
aws_route_table_association.db-private["sub-c"]: Refreshing state... [id=rtbassoc-05f0a267809b21595]
aws_route_table_association.db-private["sub-a"]: Refreshing state... [id=rtbassoc-0e2ea2197b38ae64a]
aws_route_table_association.db-private["sub-b"]: Refreshing state... [id=rtbassoc-0def46b2a878eac6e]
aws_route_table_association.web-private["sub-b"]: Refreshing state... [id=rtbassoc-06526842a36d36c44]
aws_route_table_association.public["sub-c"]: Refreshing state... [id=rtbassoc-0e8dc118d31a26ffc]
aws_route_table_association.public["sub-a"]: Refreshing state... [id=rtbassoc-0094f289e083b5ca8]
aws_route_table_association.public["sub-b"]: Refreshing state... [id=rtbassoc-0ae49cccd47bc7c91]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.private_http_https will be created
  + resource "aws_security_group" "private_http_https" {
      + arn                    = (known after apply)
      + description            = "Allow 80, 443 inbound traffic from ALB-SG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB-SG"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from ALB-SG"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "private_http_https"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "private_http_https"
        }
      + tags_all               = {
          + "Name" = "private_http_https"
        }
      + vpc_id                 = "vpc-09e75138a8dbaa8ed"
    }

  # aws_security_group.private_mysql will be created
  + resource "aws_security_group" "private_mysql" {
      + arn                    = (known after apply)
      + description            = "Allow port 3306 inbound traffic from private_http_https"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from private_http_https"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "private_mysql"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "private_mysql"
        }
      + tags_all               = {
          + "Name" = "private_mysql"
        }
      + vpc_id                 = "vpc-09e75138a8dbaa8ed"
    }

  # aws_security_group.public_http_https will be created
  + resource "aws_security_group" "public_http_https" {
      + arn                    = (known after apply)
      + description            = "Allow 80, 443 inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "public_http_https"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "public_http_https"
        }
      + tags_all               = {
          + "Name" = "public_http_https"
        }
      + vpc_id                 = "vpc-09e75138a8dbaa8ed"
    }

  # aws_security_group.public_ssh will be created
  + resource "aws_security_group" "public_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH port 22 inbound traffic from My IP"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "202.142.36.143/32",
                ]
              + description      = "SSH port 22 inbound from My IP"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "public_ssh"
        }
      + tags_all               = {
          + "Name" = "public_ssh"
        }
      + vpc_id                 = "vpc-09e75138a8dbaa8ed"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @NgaNaNa, Action: `pull_request`*